phil220.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-11 Tue 15:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PHIL 220</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Andrew Hooke" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">PHIL 220</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcb72feb">Menu</a></li>
<li><a href="#orgc5e389e">Jan 11 2022</a>
<ul>
<li><a href="#org591ef21">What reasons might there be for thinking that there is or isn't a God as traditionally concieved and what difference would this make?</a></li>
<li><a href="#org463ed25">The Course</a>
<ul>
<li><a href="#orga723c34">The Basics</a></li>
<li><a href="#org302a248">The Goals</a></li>
</ul>
</li>
<li><a href="#orgb9793d4">1.1 - Some Logic</a>
<ul>
<li><a href="#org683a7bc">Deductive arguments</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb72feb" class="outline-2">
<h2 id="orgcb72feb">Menu</h2>
<div class="outline-text-2" id="text-orgcb72feb">
<p><a href="https://zjquid.github.io/">Homepage</a></p>
</div>
</div>
<div id="outline-container-orgc5e389e" class="outline-2">
<h2 id="orgc5e389e">Jan 11 2022</h2>
<div class="outline-text-2" id="text-orgc5e389e">
</div>
<div id="outline-container-org591ef21" class="outline-3">
<h3 id="org591ef21">What reasons might there be for thinking that there is or isn't a God as traditionally concieved and what difference would this make?</h3>
<div class="outline-text-3" id="text-org591ef21">
<ul class="org-ul">
<li>Knowledge of "large" events like weather - where in the past these things were attributed to acts of God - can now be explained. A drought, for example, might be seen as punishment from God in the past, and in the present day, can be accurately pinned on a number of things (but not the moral standing of the people).</li>
<li>This difference puts a certain amount of blame on different sources, one former the people themselves, and the latter being on environmental factors.</li>
<li>Gives purpose to people's lives.</li>
<li>Human exceptionalism, humans being more important that other creatures due to the idea of being created in God's image.</li>
</ul>
</div>
</div>
<div id="outline-container-org463ed25" class="outline-3">
<h3 id="org463ed25">The Course</h3>
<div class="outline-text-3" id="text-org463ed25">
</div>
<div id="outline-container-orga723c34" class="outline-4">
<h4 id="orga723c34">The Basics</h4>
<div class="outline-text-4" id="text-orga723c34">
<ul class="org-ul">
<li>Primarily philosophical, not historical.</li>
<li>Philosophical &#x2013;&gt; human reason. "Natural Theology" as opposed to "Real Theology."</li>
<li>Arguments in favor of and against conceptions of God - Classical Theism
<ul class="org-ul">
<li>Judaism, Christianity, Islam</li>
</ul></li>
<li>Why focus on this?
<ul class="org-ul">
<li>Classical Theism has shaped western society, and is most prevalent in our lives.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org302a248" class="outline-4">
<h4 id="org302a248">The Goals</h4>
<div class="outline-text-4" id="text-org302a248">
<ul class="org-ul">
<li>Learn some major arguments in central problems of the philosophy of religion.</li>
<li>To improve the ability to critically and actively read major work in the philosophy of religion.</li>
<li>To grow in the ability to make philosophical arguments and pose philosophical questions, both verbally and in writing.</li>
<li>To become more proficient in productively engaging viewpoints quite different from your own.
<ul class="org-ul">
<li>Professor's goal is to be a moderator, not use this course as a soapbox to project his own beliefs/opinions on said viewpoints.</li>
</ul></li>
</ul>
</div>
</div>
</div>



<div id="outline-container-orgb9793d4" class="outline-3">
<h3 id="orgb9793d4">1.1 - Some Logic</h3>
<div class="outline-text-3" id="text-orgb9793d4">
</div>
<div id="outline-container-org683a7bc" class="outline-4">
<h4 id="org683a7bc">Deductive arguments</h4>
<div class="outline-text-4" id="text-org683a7bc">
<ul class="org-ul">
<li>Validity is only about the structure of the argument, not about the truth of the premises or conclusion</li>
<li>Soundness of argument - an argument is sound if it is valid and the premises are true</li>
<li><p>
Example:
</p>
<ul class="org-ul">
<li>if mars is the size of a marble, then I am Kanye West.</li>
<li>mars is the size of a marble.</li>
<li>therefore, I am Kanye West.</li>
</ul>
<p>
This argument is valid, but not sound (because the premises are not true).
Validity is about <b>structure</b>.
</p></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org2d1b598"></a>Logical Fallacies<br />
<div class="outline-text-5" id="text-org2d1b598">
<ul class="org-ul">
<li>Affirming the consequent
Basically running the argument backwards, not necessarily valid.</li>
<li>Denying the antecedent
Basically the opposite/negative version of the argument: if NOT this, then NOT that&#x2026; not necessarily valid.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andrew Hooke</p>
<p class="date">Created: 2022-01-11 Tue 15:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
